using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace VikingEngine.DSSWars.Presentation
{
    partial class Thai
    {
        /// <summary>
        /// A way to merge to random words
        /// </summary>
        public override string NameGenerator_AOfTheB => "{0}|แห่ง|{1}";

        static readonly List<string> adjectives = new List<string> {
            "ผู้|กล้า", "ลึกลับ", "ทมิฬ", "ทอง|คำ", "โบราณ", "เยือก|แข็ง", "นิรันดร์",
            "ใน|เงามืด", "สุก|สกาว", "สี|ชาด", "ดุร้าย", "เกริก|ไกร", "ผู้|สูง|ศักดิ์", "ป่า|เถื่อน",
            "พยาบาท", "หาญ|กล้า", "พายุ", "สง่า|งาม", "ไร้|ปรานี", "เจ้า|เล่ห์", "เจิด|จรัส",
            "สนธยา", "รุ่ง|อรุณ", "ยาม|เย็น", "เหล็ก|กล้า", "เงิน", "วิญญาณ", "จาก|สรวง|สวรรค์", "จาก|นรก",
            "ต้อง|มนต์", "ลี้|ลับ", "ที่|ซ่อน|อยู่", "ที่|สาบ|สูญ", "ที่|ถูก|ลืม", "ใน|ตำนาน", "แห่ง|ปกรณัม",
            "เงียบ|สงัด", "กึกก้อง", "เพลิง", "แตก|สลาย", "พเนจร", "เหนือ|โลก", "มายา",
            "มรกต", "ทับทิม", "ไพลิน", "เพชร", "หยก", "แข็ง|แกร่ง"
        };

        static readonly List<string> colors = new List<string> {
            "แดง", "ดำ", "ขาว", "เขียว|มรกต", "ฟ้า|คราม", "แดง|สด", "ม่วง", "น้ำ|เงิน|เข้ม",
            "ทอง", "เงิน", "ทอง|แดง", "ทอง|เหลือง", "น้ำ|เงิน|ไพลิน", "แดง|ทับทิม", "ม่วง|อเมทิสต์",
            "หยก", "ฟ้า|ใส", "แดง|เข้ม", "ชมพู|เข้ม", "ดำ|ขลับ", "ขาว|งา|ช้าง", "เขียว|น้ำ|ทะเล", "เทอร์|ควอยซ์",
            "น้ำ|ตาล|แดง", "เขียว|มะกอก", "ชมพู|พีช", "เทา", "ถ่าน", "ลา|เวน|เดอร์", "เขียว|มะนาว", "น้ำ|เงิน|เข้ม",
            "เหลือง|ดิน", "ม่วง|ลูก|พลัม", "ควอตซ์", "ชมพู|ส้ม", "น้ำ|ตาล|อ่อน", "น้ำ|เงิน|สด", "แดง|แสด", "ม่วง|อ่อน",
            "เขียว|เทา", "เหลือง", "น้ำ|เงิน|หม่น", "ฟ้า", "น้ำ|เงิน", "เขียว", "เขียว|อ่อน",
            "ไอ|ริส", "มะลิ", "กากี"
        };

        static readonly List<string> creatures = new List<string> {
    "มังกร", "หมา|ป่า", "อินทรี", "สิงโต", "อัศวิน", "กริฟฟิน", "เซน|ทอร์",
    "เอลฟ์", "คน|แคระ", "ยักษ์", "เทว|ทูต", "เงือก", "ยูนิ|คอร์น",
    "ฟีนิกซ์", "กวาง|ตัว|ผู้", "ม้า", "เหยี่ยว", "เสือ", "หมี", "แพน|เธอร์",
    "นก|อินทรี", "เหยี่ยว|ล่า|เหยื่อ", "โลมา", "วาฬ", "ช้าง", "เสือ|ดาว", "เสือ|ชี|ตาห์",
    "อีกา", "นก|เค้า|แมว", "นก|ยูง", "หงส์", "สุนัข|จิ้งจอก", "กวาง",
    "พารา|ดิน", "จอม|เวทย์", "นัก|เวทย์", "โจร", "ซามูไร", "นินจา",
    "พล|ธนู", "พราน|ป่า", "นัก|บวช", "ผู้|แสวง|บุญ", "หมอ|ผี", "ดรู|อิด",
    "สฟิงซ์", "เพกา|ซัส", "เสือ|คู|ก้า", "เสือ|จา|กัวร์", "กระทิง", "อสรพิษ"
};

        static readonly List<string> places = new List<string> {
    "พงไพร", "แดน|ร้าง", "ซาก|ปรัก|หัก|พัง", "โอ๊ค", "ภูเขา", "ทะเล|สาบ", "แม่|น้ำ", "ทะเล",
    "ปราสาท", "หอ|คอย", "คุก|ใต้|ดิน", "ถ้ำ", "พระ|ราช|วัง", "วิหาร", "ศาล|เจ้า",
    "สวน", "หมู่บ้าน", "เมือง", "อาณา|จักร", "จักร|วรรดิ", "ทะเล|ทราย", "ธาร|น้ำ|แข็ง",
    "ภูเขา|ไฟ", "หุบ|เขา", "หน้า|ผา", "ป้อม|ปราการ", "ท่า|เรือ", "เกาะ", "คาบ|สมุทร",
    "ที่|ราบ", "หนอง|น้ำ", "แนว|ปะการัง", "สะ|วัน|นา", "ทุน|ดรา", "โลก|ใต้|ดิน", "วัง|วน",
    "ต้น|น้ำ", "ดง|ไม้", "ทุ่ง|หญ้า", "ฟยอร์ด", "โตรก|เขา", "ที่|ราบ|สูง", "บึง",
    "ปลัก|เลน", "ลาน|ป่า", "ดวง|จันทร์", "ดวง|ดาว", "กา|แล็ก|ซี", "เน|บิว|ลา", "อุกกาบาต",
    "ดาว|หาง", "สะเก็ด|ดาว", "หลุม|ดำ", "ความ|ว่าง|เปล่า", "เน็ก|ซัส", "มิติ", "สถาน|ศักดิ์สิทธิ์",
    "ลาน|ประลอง", "โคลอส|เซียม", "สถาบัน", "ห้อง|สมุด", "หอ|จดหมาย|เหตุ"
};

        static readonly List<string> titles = new List<string> {
    "กอง|พล", "กอง|ร้อย", "หน่วย|ทหาร", "กอง|พัน", "กรม|ทหาร", "กอง|บัญชา|การ", "กอง|กำลัง",
    "ฝูง|บิน", "หมวด|ทหาร", "กอง|ตระเวน", "หน่วย|แยก", "กอง|หนุน", "กอง|ทัพ|จัด|แถว", "หมู่|รบ",
    "ทีม", "ยูนิต", "พลัง", "กอง|ทัพ|ใหญ่", "ฝูง|ปีศาจ", "กอง|ทัพ", "กอง|เรือ|รบ", "กอง|เรือ", "กอง|เรือ|เล็ก",
    "ปีก|ทัพ", "กลุ่ม", "ฝูง", "วง|กลม", "สภา", "สมัชชา", "สมาคม", "ภาคี",
    "คณะ|มิตร|ภาพ", "ตระกูล", "ชน|เผ่า", "ญาติ|มิตร", "ราช|วงศ์", "จักร|วรรดิ", "ราช|องครักษ์",
    "ราช|รัฐ", "ดัช|ชี", "บา|โร|นี", "บท|ตอน", "พันธ|สัญญา", "สมา|คม|ลับ",
    "กลุ่ม|ร่วม|มือ", "พันธ|มิตร", "สมา|พันธ|รัฐ", "สห|พันธ|รัฐ", "สัน|นิ|บาต", "สมาคม|วิชา|ชีพ",
    "สถาบัน", "สำนัก", "เหล่านักรบ", "ปวง|ชน", "อำนาจ"
};

        static readonly List<string> symbols = new List<string> {
    "ลิลลี่", "หอ|คอย", "หอก", "โล่", "มงกุฎ", "ดาบ", "ปราสาท", "ดาว",
    "พระ|จันทร์", "ดวง|อาทิตย์", "ดาว|หาง", "เปลว|ไฟ", "เกลียว|คลื่น", "ภูเขา", "ต้น|ไม้", "ป่า",
    "สาย|น้ำ", "หิน", "ทั่ง", "ค้อน", "ขวาน", "ธนู", "ลูก|ศร", "ซอง|ธนู",
    "หมวก|เหล็ก", "ถุง|มือ|เหล็ก", "ชุด|เกราะ", "โซ่ตรวน", "กุญแจ", "แหวน", "แม่|กุญแจ", "ตำรา", "ม้วน|กระดาษ",
    "ยา|ปรุง", "ลูก|แก้ว", "บัลลังก์", "ธง|ชัย", "แหวน", "อัญมณี", "พีระมิด", "เสา|หิน",
    "หอ|คอย", "สะพาน", "ประตู", "กำแพง", "จอก", "ตะเกียง", "เทียน", "ระฆัง",
    "ขนนก", "แก้ว", "เข็ม|ทิศ"
};

        /// <summary>
        /// Returning static lists is important for performance
        /// </summary>
        public override List<string> NameGenerator_Army_Adjectives => adjectives;
        public override List<string> NameGenerator_Army_Colors => colors;
        public override List<string> NameGenerator_Army_Creatures => creatures;
        public override List<string> NameGenerator_Army_Places => places;
        public override List<string> NameGenerator_Army_Titles => titles;
        public override List<string> NameGenerator_Army_Symbols => symbols;


        /*
* ระบบสุ่มชื่อจะสร้างชื่อเมืองที่ไม่ซ้ำกันโดยการรวมพยางค์แบบสุ่ม
* พยางค์จะถูกแบ่งออกเป็น ทั่วไป, เหนือ (สำเนียงนอร์ดิก), ตะวันตก (อังกฤษโบราณ), ตะวันออก (เอเชีย) และใต้ (เมดิเตอร์เรเนียน)
*/

        static readonly List<string> generalSyllables = new List<string>
{
    "อาร์", "เบล", "คาร์", "ดัน", "เอล", "เฟน", "เกลน", "ฮัล", "ไอ|เวอร์", "จุน",
    "เคล", "ลิม", "มอน", "นอร์", "โอ๊ค", "เพล", "เควน", "ริล", "เซน", "ตาล",
    "เอิร์น", "เวล", "เวลล์", "เซน", "เยล", "เซล", "แอช", "โบร", "เคร", "เดลล์",
    "เอ็ค", "เฟย์", "กิล", "เฮอร์", "อิสค์", "จอร์", "เคย์", "ลอน", "ไมร์", "น็อค",
    "ออร์ป", "เพ็นน์", "ควิลล์", "รอสต์", "ซาร์น", "ทิล", "อัด", "เวิร์น", "วิสต์", "ยาร์น", "ซอร์น"
};
        static readonly List<string> generalTownSuffixes = new List<string>
{ "ทาวน์", "ฟอร์ด", "เบิร์ก", "วิลล์", "สเตด", "วิก", "มอนต์", "ฟิลด์", "พอร์ต", "เดล" };

        static readonly List<string> northSyllables = new List<string>
{
    "ฟยอร์", "สโคล", "วาร์ก", "อุลฟ์", "ฟรอสต์", "บียอร์น", "สตอร์", "ฮวิต", "ยาร์น", "สเน",
    "ควิสต์", "ลุนด์", "นอร์ด", "ออล์ฟ", "พิล", "รูน", "ซิก", "ธอร์", "อุลฟ์", "วาลด์",
    "อิงก์", "แอก", "บริม", "ดราค", "เอร์", "เฟรย์", "กิม", "ฮาลว์", "ไอ|วาร์", "โย",
    "เคลด์", "ลิงก์", "มักน์", "นัตต์", "โอดิน", "พริด", "ควอร์", "รอสต์", "ซิฟ", "ทจอร์น",
    "อุล|เฟอร์", "วิด", "วินด์", "ซิล", "อีร์ล", "ซอร์น", "แอสค์", "โบรค", "ดาห์ล", "เอ็งก์"
};
        static readonly List<string> northTownSuffixes = new List<string>
{ "วิก", "สตาด", "ฟยอร์ด", "เบิร์ก", "เนส", "ดาล", "ไฮม์", "การ์ด", "ฮัฟน์", "แลนด์", "อุล" };

        static readonly List<string> westSyllables = new List<string>
{
    "วิน", "ลัน", "แฮม", "ฟอร์ด", "สเตอร์", "เบิร์ก", "ไชร์", "เวลล์", "ตัน", "วิก",
    "บาร์ด", "คลิฟ", "เดลล์", "เอส", "กราฟ", "โฮลต์", "ไอ|เร", "เจสต์", "เคนต์", "ลี",
    "มัวร์", "นอร์", "อ็อกซ์", "เพอร์|รี", "เควน", "ริฟต์", "สวอร์ด", "เทร", "อุลม์", "เวอร์",
    "วอร์", "เยต", "ซีล", "อาร์ด", "บีม", "โคฟ", "เดล", "เอฟต์", "เกล", "ฮีธ",
    "อิง|เกิล", "คีล", "ลีธ", "มาร์ช", "นีธ", "โอป", "เพล", "ควิลล์", "โรฟ", "สเคล", "แธตช์"
};
        static readonly List<string> westTownSuffixes = new List<string>
{ "ตัน", "เบิร์ก", "ฟอร์ด", "แฮม", "ไชร์", "คาส|เตอร์", "วิก", "บิว|รี", "สเตด", "วิลล์" };

        static readonly List<string> eastSyllables = new List<string>
{
    "จิน", "ซื่อ", "หยวน", "ชิง", "ลู่", "ชุน", "หมิง", "หนาน", "ผิง", "โจว",
    "ไป๋", "ตง", "ฝู", "กัว", "ฮุ่ย", "ไข่", "ลัน", "เม่ย", "นี", "โอว",
    "เป่ย", "ฉิน", "หร่าน", "ซู", "ไท่", "เว่ย", "ซี", "หยาง", "จู", "อัน",
    "ป๋อ", "ฉือ", "ต้า", "เอิน", "เฟย", "กัง", "ฮ่าว", "จี", "เคน", "เหล่ย",
    "โม่", "หนิง", "พัว", "ฉี", "โร่ว", "เซิน", "ถิง", "ว่าน", "ซิ่ง", "หยู่", "เซน"
};
        static readonly List<string> eastTownSuffixes = new List<string>
{ "หยาง", "ซาน", "จี", "อัน", "ไฮ", "เฉิง", "หลิน", "ไท่", "โข่ว", "ฟู" };

        static readonly List<string> southSyllables = new List<string>
{
    "เธ", "เน", "ลี", "คา", "เร", "สิ", "มาร์", "โพล", "อัธ", "คอร์",
    "เดล", "เอฟ", "กา", "เฮล", "อิ|โอ", "คอส", "ลา", "เม", "นิ", "โอล",
    "พา", "โร", "เซ", "ไท", "อูร์", "เว", "ซาน", "อิ|รา", "เซ", "อัล",
    "บรา", "ซี", "ดรา", "เอ|โร", "ฟี", "เกร", "ไฮ", "ไอ|ล์", "โย", "เคล",
    "ลิว", "มี", "นอส", "โอ|เป", "ฟี", "คิว", "รา", "ไซร์", "ธา", "วีร์", "วิน"
};
        static readonly List<string> southTownSuffixes = new List<string>
{ "โพลิส", "เอียม", "ออส", "อุส", "อา", "ออน", "โอ|รา", "อา|กา", "เอส", "เอ" };

        /// <summary>
        /// Returning static lists is important for performance
        /// </summary>
        public override List<string> NameGenerator_City_GeneralSyllables => generalSyllables;
        public override List<string> NameGenerator_City_GeneralTownSuffixes => generalTownSuffixes;
        public override List<string> NameGenerator_City_NorthSyllables => northSyllables;
        public override List<string> NameGenerator_City_NorthTownSuffixes => northTownSuffixes;
        public override List<string> NameGenerator_City_WestSyllables => westSyllables;
        public override List<string> NameGenerator_City_WestTownSuffixes => westTownSuffixes;
        public override List<string> NameGenerator_City_EastSyllables => eastSyllables;
        public override List<string> NameGenerator_City_EastTownSuffixes => eastTownSuffixes;
        public override List<string> NameGenerator_City_SouthSyllables => southSyllables;
        public override List<string> NameGenerator_City_SouthTownSuffixes => southTownSuffixes;


    }
}
